# s = []
# for N in range(1, 1000):
#     n = bin(N)[2:]
#     if N % 2 == 0:
#         n = '10' + n
#     else:
#         n = '1' + n + '01'
#     r = int(n, 2)
#     if r > 516:
#         s.append(N)
# print(min(s))

# --------------------перевод в другие сист. счисления_____________
# def c(x):
#     s = ''
#                                 |d = '0123456789abc...'
#     while x > 0:
#         s = str(x % 3) + s      | d[x%12]+s
#         x = x//3
#     return s

# ____________________перевернуть число____________________________
# def r(x):
#     n = 0
#     while x > 0:
#         d = x % 10
#         x = x // 10
#         n = n* 10
#         n = n + d
#     return n

# ____________________добавить нули для 8-бит_______________________
# bin(50)[2:].zfill(8)